app/views/users/edit.html.erb

SELECT "roles".* FROM "roles"
---

    <%= form.collection_check_boxes :role_ids, Role.all, :id, :name %>