app/views/users/index.html.erb

SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 1]]
---
      <td><%= user.updated_at %></td>
      <td><span class="badge bg-success"> <%= user.roles.pluck(:name) %> </span></td>