app/controllers/records_controller.rb

    def create
        @record = Record.new(params.require(:record).permit(:name,:fathername,:mothername,:email,:address,:city,:state,:phoneno,:tenth,:twelve,:firstsem,:secondsem))
        if @record.save
---
INSERT INTO "records" ("name", "fathername", "mothername", "email", "address", "city", "state", "phoneno", "tenth", "twelve", "firstsem", "secondsem", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def show
        @record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @record = Record.find(params[:id])
        @record.destroy
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 3]]