app/views/layouts/_navigation.html.erb

SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 1]]
---
        <%= link_to "Log Out" , destroy_user_session_path(@user), data: { turbo_method: :delete}, class: "btn btn-success"  %> </a>
         <span class="badge bg-danger"> <%= current_user.roles.pluck(:name) %> </span>